app/views/jobs/jobs_with_connections.html.erb

      <% @jobs.each do |job| %>
        <% if Position.find_by_company_id(job.company.id) != nil %>
---
SELECT "positions".* FROM "positions" WHERE "positions"."company_id" = 103 LIMIT 1