app/views/companies/companies_with_jobs.html.erb

SELECT COUNT(*) FROM "linkedinusers" INNER JOIN "positions" ON "linkedinusers"."id" = "positions"."linkedinuser_id" WHERE "positions"."company_id" = 108
---
              <th><%= link_to job.title, job %></th>
              <th><%= company.linkedinusers.size %></th>