app/views/companies/index.html.erb

          <div>
            <p>Jobs <span><%= tri_company[0].jobs.size %></span> Connections <span><%= tri_company[0].linkedinusers.size %></span></p>
---
SELECT COUNT(*) FROM "linkedinusers" INNER JOIN "positions" ON "linkedinusers"."id" = "positions"."linkedinuser_id" WHERE "positions"."company_id" = 103