app/views/linkedinusers/show_connections.html.erb

SELECT "companies".* FROM "companies" INNER JOIN "positions" ON "companies"."id" = "positions"."company_id" WHERE "positions"."linkedinuser_id" = 1 LIMIT 1
SELECT "positions".* FROM "positions" WHERE "positions"."linkedinuser_id" = 1 LIMIT 1
---
          <th><%= link_to (linkedinuser.first_name + " " + linkedinuser.last_name), linkedinuser%></th>
          <th><%= link_to linkedinuser.companies.first.company_linkedin_name, linkedinuser.companies.first %></th>
          <th><%= linkedinuser.positions.first.title %></th>