app/views/linkedinusers/show.html.erb

        </tr>
        <% @linkedinuser.positions.each do |position| %>
---
SELECT "positions".* FROM "positions" WHERE "positions"."linkedinuser_id" = 1 LIMIT 1