app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
  def companies_with_jobs
    @companies = Company.all