app/controllers/linkedin_controller.rb

SELECT "linkedin_oauth_settings".* FROM "linkedin_oauth_settings" WHERE "linkedin_oauth_settings"."user_id" = 1 LIMIT 1
---
  def index
    unless LinkedinOauthSetting.find_by_user_id(current_user.id).nil?

INSERT INTO "linkedin_oauth_settings" ("asecret", "atoken", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def oauth_account
    client = LinkedIn::Client.new('ow5o6vn3mtlg', 'vu2SC19UCm2FpPYJ', @@config)
    pin = params[:oauth_verifier]
    if pin
      atoken, asecret = client.authorize_from_request(session[:rtoken], session[:rsecret], pin)
      LinkedinOauthSetting.create!(:asecret => asecret, :atoken => atoken, :user_id => current_user.id)

SELECT "linkedin_oauth_settings".* FROM "linkedin_oauth_settings" WHERE "linkedin_oauth_settings"."user_id" = 1 LIMIT 1
---
  def generate_linkedin_oauth_url
    if LinkedinOauthSetting.find_by_user_id(current_user.id).nil?