app/controllers/linkedinusers_controller.rb

  def show
    @linkedinuser = Linkedinuser.find(params[:id])
---
SELECT "linkedinusers".* FROM "linkedinusers" WHERE "linkedinusers"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def show_connections
    @linkedinusers = Linkedinuser.all
---
SELECT "linkedinusers".* FROM "linkedinusers"